index=auth sourcetype=authentication action=failure
| bin _time span=15m
| stats dc(user) as unique_users values(user) as attempted_users count as failures by _time, src_ip
| where unique_users >= 5 AND failures >= 5
| sort - unique_users
